Repository: Lin0u0/InkPond
Catalog: InkPond/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant_hk

# a11y.cache_refresh.started
source: Clearing the package cache and recompiling.
zh_hans: 正在清理包缓存并重新编译。
zh_hant_hk: 正在清除套件快取並重新編譯。

# a11y.compile.failed
source: Compilation failed.
zh_hans: 编译失败。
zh_hant_hk: 編譯失敗。

# a11y.compile.success
source: Compilation succeeded.
zh_hans: 编译成功。
zh_hant_hk: 編譯成功。

# a11y.document_list.add.hint
source: Creates a new document.
zh_hans: 创建一个新文档。
zh_hant_hk: 建立一份新文件。

# a11y.document_list.add.label
source: Create document
zh_hans: 新建文档
zh_hant_hk: 新增文件

# a11y.document_list.settings.hint
source: Shows app settings.
zh_hans: 显示应用设置。
zh_hant_hk: 顯示 App 設定。

# a11y.document_list.settings.label
source: Open settings
zh_hans: 打开设置
zh_hant_hk: 打開設定

# a11y.document_row.action.delete
source: Delete
zh_hans: 删除
zh_hant_hk: 刪除

# a11y.document_row.action.export_source
source: Export source
zh_hans: 导出源码
zh_hant_hk: 匯出原始碼

# a11y.document_row.action.rename
source: Rename
zh_hans: 重命名
zh_hant_hk: 重新命名

# a11y.document_row.action.share_pdf
source: Share PDF
zh_hans: 分享 PDF
zh_hant_hk: 分享 PDF

# a11y.document_row.action.unlink
source: Unlink
zh_hans: 解除链接
zh_hant_hk: 解除連結

# a11y.document_row.hint
source: Opens the document. Additional actions are available.
zh_hans: 双击打开文档。还有更多可用操作。
zh_hant_hk: 點兩下可打開文件。還有更多可用操作。

# a11y.document_row.label_format
source: %1$@. Created %2$@. Modified %3$@.
zh_hans: %1$@。创建于 %2$@。修改于 %3$@。
zh_hant_hk: %1$@。建立於 %2$@。修改於 %3$@。

# a11y.document.created
source: Created %@.
zh_hans: 已创建 %@。
zh_hant_hk: 已建立 %@。

# a11y.document.imported
source: Imported %@.
zh_hans: 已导入 %@。
zh_hant_hk: 已匯入 %@。

# a11y.editor.menu.hint
source: Shows project, compile, and slideshow actions.
zh_hans: 显示项目、编译和幻灯片相关操作。
zh_hant_hk: 顯示專案、編譯與投影片相關操作。

# a11y.editor.menu.label
source: More actions
zh_hans: 更多操作
zh_hant_hk: 更多操作

# a11y.editor.share.hint
source: Exports the current document.
zh_hans: 导出当前文档。
zh_hant_hk: 匯出目前文件。

# a11y.editor.share.label
source: Share
zh_hans: 分享
zh_hant_hk: 分享

# a11y.editor.split.action.reset
source: Reset split
zh_hans: 重置分栏
zh_hant_hk: 重設分欄

# a11y.editor.split.hint
source: Adjust the split between editor and preview.
zh_hans: 调整编辑器和预览的宽度比例。
zh_hant_hk: 調整編輯器與預覽的寬度比例。

# a11y.editor.split.label
source: Editor and preview divider
zh_hans: 编辑器与预览分隔条
zh_hant_hk: 編輯器與預覽分隔條

# a11y.editor.split.value_format
source: Editor %1$d percent, preview %2$d percent
zh_hans: 编辑器 %1$d%%，预览 %2$d%%
zh_hant_hk: 編輯器 %1$d%%，預覽 %2$d%%

# a11y.editor.text.hint
source: Edits the current Typst source.
zh_hans: 编辑当前 Typst 源码。
zh_hant_hk: 編輯目前的 Typst 原始碼。

# a11y.editor.text.label
source: Typst editor
zh_hans: Typst 编辑器
zh_hant_hk: Typst 編輯器

# a11y.export.ready
source: Export is ready.
zh_hans: 导出已就绪。
zh_hant_hk: 匯出已就緒。

# a11y.keyboard.insert.hint
source: Inserts this symbol into the editor.
zh_hans: 将这个符号插入编辑器。
zh_hant_hk: 將這個符號插入編輯器。

# a11y.keyboard.photo.hint
source: Choose an image to insert into the editor.
zh_hans: 选择要插入编辑器的图片。
zh_hant_hk: 選擇要插入編輯器的圖片。

# a11y.keyboard.photo.label
source: Insert photo
zh_hans: 插入图片
zh_hant_hk: 插入圖片

# a11y.keyboard.redo.hint
source: Redo the last undone edit.
zh_hans: 恢复刚刚撤销的编辑。
zh_hant_hk: 恢復剛剛復原的編輯。

# a11y.keyboard.redo.label
source: Redo
zh_hans: 重做
zh_hant_hk: 重做

# a11y.keyboard.snippet.hint
source: Browse and insert code snippets.
zh_hans: 浏览并插入代码片段。
zh_hant_hk: 瀏覽並插入代碼片段。

# a11y.keyboard.snippet.label
source: Insert snippet
zh_hans: 插入代码片段
zh_hant_hk: 插入代碼片段

# a11y.keyboard.symbol.asterisk
source: Insert asterisk
zh_hans: 插入星号
zh_hant_hk: 插入星號

# a11y.keyboard.symbol.at_sign
source: Insert at sign
zh_hans: 插入 @ 符号
zh_hant_hk: 插入 @ 符號

# a11y.keyboard.symbol.dollar
source: Insert dollar sign
zh_hans: 插入美元符号
zh_hant_hk: 插入美元符號

# a11y.keyboard.symbol.equals
source: Insert equals sign
zh_hans: 插入等号
zh_hant_hk: 插入等號

# a11y.keyboard.symbol.hash
source: Insert hash
zh_hans: 插入井号
zh_hant_hk: 插入井號

# a11y.keyboard.symbol.left_angle
source: Insert less-than sign
zh_hans: 插入小于号
zh_hant_hk: 插入小於號

# a11y.keyboard.symbol.left_brace
source: Insert left brace
zh_hans: 插入左大括号
zh_hant_hk: 插入左大括號

# a11y.keyboard.symbol.left_bracket
source: Insert left bracket
zh_hans: 插入左中括号
zh_hant_hk: 插入左中括號

# a11y.keyboard.symbol.left_parenthesis
source: Insert left parenthesis
zh_hans: 插入左括号
zh_hant_hk: 插入左括號

# a11y.keyboard.symbol.right_angle
source: Insert greater-than sign
zh_hans: 插入大于号
zh_hant_hk: 插入大於號

# a11y.keyboard.symbol.right_brace
source: Insert right brace
zh_hans: 插入右大括号
zh_hant_hk: 插入右大括號

# a11y.keyboard.symbol.right_bracket
source: Insert right bracket
zh_hans: 插入右中括号
zh_hant_hk: 插入右中括號

# a11y.keyboard.symbol.right_parenthesis
source: Insert right parenthesis
zh_hans: 插入右括号
zh_hant_hk: 插入右括號

# a11y.keyboard.symbol.slash
source: Insert slash
zh_hans: 插入斜杠
zh_hant_hk: 插入斜線

# a11y.keyboard.symbol.tab
source: Insert indentation
zh_hans: 插入缩进
zh_hant_hk: 插入縮排

# a11y.keyboard.symbol.underscore
source: Insert underscore
zh_hans: 插入下划线
zh_hant_hk: 插入底線

# a11y.keyboard.undo.hint
source: Undo the last edit.
zh_hans: 撤销上一次编辑。
zh_hant_hk: 復原上一次編輯。

# a11y.keyboard.undo.label
source: Undo
zh_hans: 撤销
zh_hant_hk: 復原

# a11y.preview.close
source: Close preview
zh_hans: 关闭预览
zh_hant_hk: 關閉預覽

# a11y.preview.hint
source: Shows the compiled document preview.
zh_hans: 显示编译后的文档预览。
zh_hant_hk: 顯示編譯後的文件預覽。

# a11y.preview.label
source: Preview
zh_hans: 预览
zh_hant_hk: 預覽

# a11y.preview.placeholder.hint
source: Start typing to generate a preview.
zh_hans: 开始输入即可生成预览。
zh_hant_hk: 開始輸入即可產生預覽。

# a11y.preview.placeholder.label
source: Preview placeholder
zh_hans: 预览占位
zh_hant_hk: 預覽預留區

# a11y.preview.value.empty
source: No preview yet
zh_hans: 暂无预览
zh_hant_hk: 尚無預覽

# a11y.preview.value.error
source: Preview contains a compilation error
zh_hans: 预览存在编译错误
zh_hant_hk: 預覽包含編譯錯誤

# a11y.preview.value.ready
source: Preview available
zh_hans: 预览可用
zh_hant_hk: 預覽可用

# a11y.project_files.add_menu.hint
source: Create a new Typst file or import files.
zh_hans: 新建 Typst 文件或导入文件。
zh_hant_hk: 建立 Typst 檔案或匯入檔案。

# a11y.project_files.add_menu.label
source: Add project file
zh_hans: 添加项目文件
zh_hant_hk: 新增專案檔案

# a11y.project_files.kind.file
source: File
zh_hans: 文件
zh_hant_hk: 檔案

# a11y.project_files.kind.folder
source: Folder
zh_hans: 文件夹
zh_hant_hk: 資料夾

# a11y.project_files.kind.font
source: Font
zh_hans: 字体
zh_hant_hk: 字體

# a11y.project_files.kind.image
source: Image
zh_hans: 图片
zh_hant_hk: 圖片

# a11y.project_files.kind.reference
source: Reference file
zh_hans: 参考文件
zh_hant_hk: 參考檔案

# a11y.project_files.kind.typ
source: Typst file
zh_hans: Typst 文件
zh_hant_hk: Typst 檔案

# a11y.project_files.row.folder.label
source: Folder, %@
zh_hans: 文件夹，%@
zh_hant_hk: 資料夾，%@

# a11y.project_files.row.hint.expand
source: Double-tap to expand or collapse this folder.
zh_hans: 双击展开或收起此文件夹。
zh_hant_hk: 點兩下可展開或收合此資料夾。

# a11y.project_files.row.hint.open
source: Double-tap to open this file.
zh_hans: 双击打开此文件。
zh_hant_hk: 點兩下可打開此檔案。

# a11y.project_files.row.hint.preview
source: Double-tap to preview this file.
zh_hans: 双击预览此文件。
zh_hant_hk: 點兩下可預覽此檔案。

# a11y.project_files.settings.hint
source: Shows settings for the current project.
zh_hans: 显示当前项目的设置。
zh_hant_hk: 顯示目前專案的設定。

# a11y.project_files.settings.label
source: Open project settings
zh_hans: 打开项目设置
zh_hant_hk: 打開專案設定

# a11y.settings.header.label
source: InkPond app information
zh_hans: 墨池应用信息
zh_hant_hk: 墨池 App 資訊

# a11y.sort.changed
source: Sort updated to %@.
zh_hans: 排序已更新为 %@。
zh_hant_hk: 排序已更新為 %@。

# a11y.state.collapsed
source: Collapsed
zh_hans: 已收起
zh_hant_hk: 已收合

# a11y.state.expanded
source: Expanded
zh_hans: 已展开
zh_hant_hk: 已展開

# a11y.state.selected
source: Selected
zh_hans: 已选中
zh_hant_hk: 已選取

source: Acknowledgements
zh_hans: 致谢
zh_hant_hk: 致謝

# action.delete
source: Delete
zh_hans: 删除
zh_hant_hk: 刪除

# action.find_replace
source: Find & Replace
zh_hans: 查找与替换
zh_hant_hk: 尋找及取代

# action.insert_image
source: Insert Image
zh_hans: 插入图片
zh_hant_hk: 插入圖片

# action.insert_snippet
source: Insert Snippet
zh_hans: 插入片段
zh_hant_hk: 插入片段

# action.typing
source: Typing
zh_hans: 输入
zh_hant_hk: 輸入

# action.unlink
source: Unlink
zh_hans: 解除链接
zh_hant_hk: 解除連結

source: Add Font…
zh_hans: 添加字体…
zh_hant_hk: 新增字型…

# alert.delete_document.message
source: "%@" will be permanently deleted.
zh_hans: "%@" 将被永久删除。
zh_hant_hk: "%@" 將會被永久刪除。

# alert.unlink_document.message
source: "%@" will be unlinked. Its original files will not be deleted.
zh_hans: "%@" 将被解除链接。其原始文件不会被删除。
zh_hant_hk: "%@" 將會被解除連結。其原始檔案不會被刪除。

source: App Appearance
zh_hans: 应用外观
zh_hant_hk: App 外觀

# app_fonts.alert.error
source: Font Error
zh_hans: 字体错误
zh_hant_hk: 字型錯誤

# app_fonts.export_warning.message
source: Project ZIP exports only the project directory. App, system, and installed fonts are not bundled and must exist separately on the destination device.
zh_hans: 项目 ZIP 只会导出项目目录。App 字体、系统字体和系统已安装字体都不会被打包，目标设备需单独提供这些字体。
zh_hant_hk: 專案 ZIP 只會匯出專案目錄。App 字型、系統字型與系統已安裝字型都不會被打包，目標裝置需另行提供這些字型。

# app_fonts.export_warning.title
source: External Fonts Not Included
zh_hans: 不包含外部字体
zh_hant_hk: 不包含外部字型

# app_fonts.overview.detail
source: Imported App fonts are available to every project. System and installed fonts can be used when a document explicitly references them. Project ZIP exports do not bundle App, system, or installed fonts.
zh_hans: 导入的 App 字体对所有项目可用。文档显式引用时，也可以使用系统字体和系统已安装字体。导出的项目 ZIP 不会打包 App、系统或系统已安装字体。
zh_hant_hk: 已匯入的 App 字型可供所有專案使用。文件明確引用時，也可使用系統字型與系統已安裝字型。匯出專案 ZIP 時不會打包 App、系統或系統已安裝字型。

# app_fonts.overview.title
source: App fonts are available to every project.
zh_hans: App 字体对所有项目可用。
zh_hant_hk: App 字型可供所有專案使用。

# app_fonts.summary.built_in_only
source: Built-in only
zh_hans: 仅内置
zh_hant_hk: 僅內置

# app_fonts.summary.imported
source: %d imported
zh_hans: 已导入 %d 个
zh_hant_hk: 已匯入 %d 個

# app_fonts.title
source: App Fonts
zh_hans: App 字体
zh_hant_hk: App 字型

# app.name
source: InkPond
zh_hans: 墨池
zh_hant_hk: 墨池

source: Appearance
zh_hans: 外观
zh_hant_hk: 外觀

source: Auto
zh_hans: 自动
zh_hant_hk: 自動

source: built-in
zh_hans: 内置
zh_hant_hk: 內置

source: Bundled CJK fonts used as default fallbacks in InkPond.
zh_hans: InkPond 默认使用的内置 CJK 后备字体。
zh_hant_hk: 墨池預設使用的內置 CJK 後備字型。

source: Bundled fonts are always available in Typst by their listed names.
zh_hans: 内置字体在 Typst 中始终可按列出的名称使用。
zh_hant_hk: 內置字型在 Typst 中一直可用，請使用列出的名稱。

source: Cache
zh_hans: 缓存
zh_hant_hk: 快取

source: Cache Error
zh_hans: 缓存错误
zh_hant_hk: 快取錯誤

source: Cached Documents
zh_hans: 已缓存文档
zh_hant_hk: 已快取文件

source: Cached Fonts
zh_hans: 已缓存字体
zh_hant_hk: 已快取字型

source: Cached Packages
zh_hans: 已缓存包
zh_hant_hk: 已快取套件

source: Cancel
zh_hans: 取消
zh_hant_hk: 取消

source: Changes apply to the editor only. Typst document output still follows the fonts declared in your source.
zh_hans: 这些更改只影响编辑器。Typst 文档输出仍遵循源码中声明的字体。
zh_hant_hk: 這些變更只影響編輯器。Typst 文件輸出仍會遵循原始碼中宣告的字型。

source: Choose Entry File
zh_hans: 选择入口文件
zh_hant_hk: 選擇入口檔案

source: Clear All
zh_hans: 全部清空
zh_hant_hk: 全部清空

source: Clear All Compile Cache
zh_hans: 清空全部编译缓存
zh_hant_hk: 清空所有編譯快取

source: Clear All Compile Cache?
zh_hans: 要清空全部编译缓存吗？
zh_hant_hk: 要清空所有編譯快取嗎？

source: Clear All Package Cache
zh_hans: 清空全部包缓存
zh_hant_hk: 清空所有套件快取

source: Clear All Package Cache?
zh_hans: 要清空全部包缓存吗？
zh_hant_hk: 要清空所有套件快取嗎？

source: Clear System Font Cache
zh_hans: 清空系统字体缓存
zh_hant_hk: 清空系統字型快取

source: Clear System Font Cache?
zh_hans: 清空系统字体缓存？
zh_hant_hk: 清空系統字型快取？

source: Compilation Error
zh_hans: 编译错误
zh_hant_hk: 編譯錯誤

source: Compile Cache
zh_hans: 编译缓存
zh_hant_hk: 編譯快取

source: Compile Now
zh_hans: 立即编译
zh_hant_hk: 立即編譯

source: Compiling…
zh_hans: 编译中…
zh_hant_hk: 編譯中…

source: Continue
zh_hans: 继续
zh_hant_hk: 繼續

source: Contributor
zh_hans: 贡献者
zh_hant_hk: 貢獻者

source: Contributors
zh_hans: 贡献者
zh_hant_hk: 貢獻者

source: Create
zh_hans: 创建
zh_hant_hk: 建立

source: Dark
zh_hans: 深色
zh_hant_hk: 深色

source: Delete
zh_hans: 删除
zh_hant_hk: 刪除

source: Delete Document
zh_hans: 删除文档
zh_hant_hk: 刪除文件

# doc.list.action.link_external
source: Link External Folder
zh_hans: 链接外部文件夹
zh_hant_hk: 連結外部資料夾

# doc.list.action.new
source: New Document
zh_hans: 新建文档
zh_hant_hk: 新增文件

# doc.list.empty.action
source: New Document
zh_hans: 新建文档
zh_hant_hk: 新增文件

# doc.list.empty.message
source: Create a new document to start writing.
zh_hans: 新建一个文档，开始写作。
zh_hant_hk: 建立新文件，開始寫作。

# doc.list.empty.title
source: No Documents Yet
zh_hans: 还没有文档
zh_hant_hk: 尚無文件

# doc.time.created
source: Created
zh_hans: 创建于
zh_hant_hk: 建立於

# doc.time.created_value
source: Created: %@
zh_hans: 创建：%@
zh_hant_hk: 建立：%@

# doc.time.modified
source: Modified
zh_hans: 修改于
zh_hant_hk: 修改於

# doc.time.modified_value
source: Modified: %@
zh_hans: 修改：%@
zh_hant_hk: 修改：%@

# doc.untitled.base
source: Untitled
zh_hans: 未命名
zh_hant_hk: 未命名

# doc.untitled.numbered
source: Untitled %d
zh_hans: 未命名 %d
zh_hant_hk: 未命名 %d

source: Documents
zh_hans: 文档
zh_hant_hk: 文件

source: Done
zh_hans: 完成
zh_hant_hk: 完成

source: Editing
zh_hans: 正在编辑
zh_hant_hk: 編輯中

source: Editor
zh_hans: 编辑
zh_hant_hk: 編輯

source: Editor Font
zh_hans: 编辑器字体
zh_hant_hk: 編輯器字型

source: Editor Theme
zh_hans: 编辑器主题
zh_hant_hk: 編輯器主題

# editor_font.preview_text
source: #let title = "InkPond" = Hello, Typst #text(size: 12pt)[Preview]
zh_hans: #let title = "InkPond" = 你好，Typst #text(size: 12pt)[预览]
zh_hant_hk: #let title = "InkPond" = 你好，Typst #text(size: 12pt)[預覽]

# editor_font.styles_count
source: %d styles
zh_hans: %d 种样式
zh_hant_hk: %d 種樣式

source: Enter a name for the new .typ file.
zh_hans: 请输入新 .typ 文件名。
zh_hant_hk: 請輸入新的 .typ 檔名。

source: Entry
zh_hans: 入口
zh_hant_hk: 入口

source: Entry File
zh_hans: 入口文件
zh_hant_hk: 入口檔案

source: Error
zh_hans: 错误
zh_hant_hk: 錯誤

# error.cache.unsafe_path
source: The cache file path is invalid.
zh_hans: 缓存文件路径无效。
zh_hant_hk: 快取檔案路徑無效。

# error.datastore.message
source: InkPond could not open its data store. Try restarting the app. If the problem persists, reinstalling may help.
zh_hans: 墨池无法打开数据存储，请尝试重新启动应用。如果问题持续存在，重新安装可能会有帮助。
zh_hant_hk: 墨池無法開啟資料儲存，請嘗試重新啟動應用程式。如果問題持續，重新安裝可能有幫助。

# error.datastore.title
source: Unable to Open Data Store
zh_hans: 无法打开数据存储
zh_hant_hk: 無法開啟資料儲存

# error.file.already_exists
source: A file named "%@" already exists.
zh_hans: 名为“%@”的文件已存在。
zh_hant_hk: 名為「%@」的檔案已存在。

# error.file.cannot_delete_entry
source: The entry file cannot be deleted.
zh_hans: 入口文件不能删除。
zh_hant_hk: 入口檔案不可刪除。

# error.file.invalid_name
source: Invalid file name: "%@".
zh_hans: 无效文件名：“%@”。
zh_hant_hk: 無效檔案名稱：「%@」。

# error.file.not_found
source: File "%@" not found.
zh_hans: 未找到文件“%@”。
zh_hant_hk: 找不到檔案「%@」。

# error.file.unsafe_path
source: Unsafe path: "%@".
zh_hans: 不安全路径：“%@”。
zh_hant_hk: 不安全路徑：「%@」。

# error.font_resolution.missing_families
source: Missing fonts: %@. Install them system-wide, import them into App Fonts, or add them to the project.
zh_hans: 缺少这些字体：%@。请先把它们安装到系统、导入到 App 字体，或加入当前项目。
zh_hant_hk: 缺少這些字型：%@。請先把它們安裝到系統、匯入到 App 字型，或加入目前專案。

# error.font_resolution.unresolved_expression
source: InkPond can resolve only literal Typst font names right now. In %1$@, replace %2$@ with a quoted family name such as "PingFang SC" or a tuple of quoted family names.
zh_hans: InkPond 目前只能解析字面量 Typst 字体名。请在 %1$@ 中把 %2$@ 改成带引号的字体名，例如 "PingFang SC"，或改成由带引号字体名组成的元组。
zh_hant_hk: InkPond 目前只支援解析字面量 Typst 字型名稱。請在 %1$@ 中把 %2$@ 改成帶引號的字型名稱，例如「PingFang SC」，或改成由帶引號字型名稱組成的 tuple。

# error.image.load_data_failed
source: Failed to load image data.
zh_hans: 加载图片数据失败。
zh_hant_hk: 載入圖片資料失敗。

# error.image.process_failed
source: Could not process image.
zh_hans: 图片处理失败。
zh_hant_hk: 無法處理圖片。

# error.local_package.invalid_archive
source: The package archive could not be unpacked.
zh_hans: 无法解压这个包压缩文件。
zh_hant_hk: 無法解壓這個套件壓縮檔。

# error.local_package.invalid_manifest
source: Invalid typst.toml: %@
zh_hans: typst.toml 无效：%@
zh_hant_hk: typst.toml 無效：%@

# error.local_package.invalid_namespace
source: The namespace is invalid. Avoid empty values and path separators.
zh_hans: 命名空间无效。不能为空，也不能包含路径分隔符。
zh_hant_hk: 命名空間無效。不能為空，也不能包含路徑分隔符。

# error.local_package.missing_manifest
source: The folder does not contain a typst.toml manifest.
zh_hans: 文件夹中缺少 typst.toml 清单文件。
zh_hant_hk: 資料夾中缺少 typst.toml 清單檔案。

# error.local_package.multiple_package_roots
source: The archive contains more than one package manifest.
zh_hans: 压缩包中包含多个包清单。
zh_hant_hk: 壓縮檔中包含多個套件清單。

# error.local_package.no_importable_items
source: No importable packages were found in the selected folder.
zh_hans: 所选文件夹里没有可导入的包。
zh_hant_hk: 所選資料夾中沒有可匯入的套件。

# error.local_package.package_exists
source: A package already exists at %@.
zh_hans: %@ 已存在同名包。
zh_hant_hk: %@ 已存在同名套件。

# error.local_package.storage_unavailable
source: Local packages storage directory is unavailable.
zh_hans: 本地包存储目录不可用。
zh_hant_hk: 本地套件儲存目錄不可用。

# error.local_package.unsupported_archive
source: Unsupported package import. Choose a folder, .zip, .tar, .tar.gz, or .tgz archive.
zh_hans: 不支持这种包导入方式。请选择文件夹、.zip、.tar、.tar.gz 或 .tgz 压缩包。
zh_hant_hk: 不支援這種套件匯入方式。請選擇資料夾、.zip、.tar、.tar.gz 或 .tgz 壓縮檔。

# error.typst.compilation_timeout
source: Compilation timed out.
zh_hans: 编译超时。
zh_hant_hk: 編譯逾時。

# error.typst.compiler_not_linked
source: Typst compiler library not linked. Run rust-ffi/build-ios.sh.
zh_hans: Typst 编译器库未链接，请运行 rust-ffi/build-ios.sh。
zh_hant_hk: Typst 編譯器函式庫尚未連結，請執行 rust-ffi/build-ios.sh。

# error.typst.unknown_compilation
source: Unknown compilation error
zh_hans: 未知编译错误
zh_hant_hk: 未知編譯錯誤

# error.zip.decompression_failed
source: Decompression failed (zlib error %d).
zh_hans: 解压失败（zlib 错误 %d）。
zh_hant_hk: 解壓失敗（zlib 錯誤 %d）。

# error.zip.invalid_data
source: The ZIP file is invalid or corrupted.
zh_hans: ZIP 文件无效或已损坏。
zh_hant_hk: ZIP 檔案無效或已損毀。

# error.zip.unsafe_path
source: ZIP contains an unsafe path: "%@".
zh_hans: ZIP 包含不安全路径：“%@”。
zh_hant_hk: ZIP 包含不安全路徑：「%@」。

# error.zip.unsupported_method
source: Unsupported compression method %d.
zh_hans: 不支持的压缩方法 %d。
zh_hant_hk: 不支援的壓縮方式 %d。

source: Export .typ
zh_hans: 导出 .typ
zh_hant_hk: 匯出 .typ

source: Export Error
zh_hans: 导出错误
zh_hant_hk: 匯出錯誤

source: Export Project as Zip
zh_hans: 导出项目为 ZIP
zh_hant_hk: 將專案匯出為 ZIP

source: File Error
zh_hans: 文件错误
zh_hant_hk: 檔案錯誤

source: Follow System
zh_hans: 跟随系统
zh_hant_hk: 跟隨系統

source: Font
zh_hans: 字体
zh_hant_hk: 字型

source: Font Directory
zh_hans: 字体目录
zh_hant_hk: 字型目錄

source: Font Family
zh_hans: 字体家族
zh_hant_hk: 字型家族

source: Font Size
zh_hans: 字号
zh_hant_hk: 字號

# font.copyName
source: Copy Font Name
zh_hans: 拷贝字体名称
zh_hant_hk: 拷貝字型名稱

# font.faces_count
source: %d faces
zh_hans: %d 个字重
zh_hant_hk: %d 個字重

# font.scope.built_in
source: built-in
zh_hans: 内置
zh_hant_hk: 內置

# font.scope.project
source: project
zh_hans: 项目
zh_hant_hk: 專案

source: Fonts
zh_hans: 字体
zh_hant_hk: 字型

source: Format
zh_hans: 格式
zh_hant_hk: 格式

source: Generated system font files stay local to this device and are excluded from iCloud Backup.
zh_hans: 生成的系统字体文件仅保留在本设备，并已排除在 iCloud 备份之外。
zh_hant_hk: 生成的系統字型檔案只會保留在本裝置，並已排除於 iCloud 備份之外。

source: Hide Details
zh_hans: 收起详情
zh_hant_hk: 收起詳情

# icloud.additional_content_footer
source: These choices control whether app fonts, local packages, and snippets are stored in iCloud when project sync is on.
zh_hans: 这些选项决定开启项目同步时，应用字体、本地包和代码片段是否也存入 iCloud。
zh_hant_hk: 這些選項決定開啟專案同步時，App 字型、本機套件和程式碼片段是否也存入 iCloud。

# icloud.additional_content_section
source: Additional Content
zh_hans: 附加内容
zh_hant_hk: 附加內容

# icloud.conflict.keep_local
source: Keep My Changes
zh_hans: 保留我的修改
zh_hant_hk: 保留我的修改

# icloud.conflict.keep_remote
source: Use Other Device's Version
zh_hans: 使用其他设备的版本
zh_hant_hk: 使用其他裝置的版本

# icloud.conflict.message
source: "%@" was modified on another device while you were editing. Choose which version to keep.
zh_hans: 「%@」在你编辑期间被其他设备修改了。请选择保留哪个版本。
zh_hant_hk: 「%@」在你編輯期間被其他裝置修改了。請選擇保留哪個版本。

# icloud.conflict.title
source: File Modified on Another Device
zh_hans: 文件在其他设备上被修改
zh_hant_hk: 檔案在其他裝置上被修改

# icloud.download_all
source: Download All Files
zh_hans: 下载所有文件
zh_hant_hk: 下載所有檔案

# icloud.error.and_more
source: and %d more…
zh_hans: 以及其他 %d 个…
zh_hant_hk: 以及其他 %d 個⋯

# icloud.error.download_timeout
source: Some files could not be downloaded from iCloud in time. Please check your network connection and try again.
zh_hans: 部分文件未能及时从 iCloud 下载。请检查网络连接后重试。
zh_hant_hk: 部分檔案未能及時從 iCloud 下載。請檢查網絡連線後重試。

# icloud.error.no_network
source: No network connection. Please check your internet and try again.
zh_hans: 没有网络连接。请检查网络后重试。
zh_hant_hk: 沒有網絡連線。請檢查網絡後重試。

# icloud.error.partial_migration
source: %d projects could not be migrated. You can retry from Settings.
zh_hans: %d 个项目未能迁移。你可以在设置中重试。
zh_hant_hk: %d 個專案未能遷移。你可以在設定中重試。

# icloud.error.sync_issues_body
source: Some files failed to sync with iCloud. This may be caused by insufficient iCloud storage, network issues, or temporary server problems. Check your iCloud storage in iOS Settings.
zh_hans: 部分文件同步 iCloud 失败。可能是 iCloud 存储空间不足、网络问题或服务器临时故障。请在系统设置中检查 iCloud 存储空间。
zh_hant_hk: 部分檔案同步 iCloud 失敗。可能是 iCloud 儲存空間不足、網絡問題或伺服器暫時故障。請在系統設定中檢查 iCloud 儲存空間。

# icloud.error.sync_issues_title
source: Sync Issues Detected
zh_hans: 检测到同步问题
zh_hant_hk: 偵測到同步問題

# icloud.error.unavailable
source: iCloud is not available. Please sign in to iCloud in Settings.
zh_hans: iCloud 不可用。请在系统设置中登录 iCloud。
zh_hant_hk: iCloud 不可用。請在系統設定中登入 iCloud。

# icloud.error.verification_failed
source: Migration verification failed for project "%@". The copy may be incomplete.
zh_hans: 项目「%@」的迁移验证失败，副本可能不完整。
zh_hant_hk: 專案「%@」的遷移驗證失敗，副本可能不完整。

# icloud.keep_downloaded_tip
source: For the best experience, open the Files app, navigate to iCloud Drive, long press the InkPond folder, and select "Keep Downloaded" to ensure files are always available offline.
zh_hans: 为获得最佳体验，请打开「文件」App，前往 iCloud 云盘，长按 InkPond 文件夹，选择「保留下载」，确保文件始终可离线使用。
zh_hant_hk: 為獲得最佳體驗，請打開「檔案」App，前往 iCloud 雲碟，長按 InkPond 資料夾，選擇「保留下載」，確保檔案始終可離線使用。

# icloud.migrating
source: Migrating files…
zh_hans: 正在迁移文件…
zh_hant_hk: 正在遷移檔案⋯

# icloud.restart_action
source: Quit InkPond
zh_hans: 退出墨池
zh_hant_hk: 結束墨池

# icloud.restart_message
source: Changing iCloud sync requires restarting InkPond for the change to take full effect.
zh_hans: 更改 iCloud 同步设置需要重启墨池才能完全生效。
zh_hant_hk: 更改 iCloud 同步設定需要重新啟動墨池才能完全生效。

# icloud.restart_title
source: Restart Required
zh_hans: 需要重启
zh_hant_hk: 需要重新啟動

# icloud.retry_migration
source: Retry Migration (%d failed)
zh_hans: 重试迁移（%d 个失败）
zh_hant_hk: 重試遷移（%d 個失敗）

# icloud.status_section
source: Sync Status
zh_hans: 同步状态
zh_hant_hk: 同步狀態

# icloud.status.checking
source: Checking sync status…
zh_hans: 正在检查同步状态…
zh_hant_hk: 正在檢查同步狀態⋯

# icloud.status.downloading
source: Downloading %d files…
zh_hans: 正在下载 %d 个文件…
zh_hant_hk: 正在下載 %d 個檔案⋯

# icloud.status.error
source: %d files with sync errors
zh_hans: %d 个文件同步出错
zh_hant_hk: %d 個檔案同步出錯

# icloud.status.no_files
source: No files in iCloud
zh_hans: iCloud 中没有文件
zh_hant_hk: iCloud 中沒有檔案

# icloud.status.not_downloaded
source: %d files not downloaded
zh_hans: %d 个文件未下载
zh_hant_hk: %d 個檔案未下載

# icloud.status.synced
source: All %d files synced
zh_hans: 全部 %d 个文件已同步
zh_hant_hk: 全部 %d 個檔案已同步

# icloud.status.syncing
source: Syncing %d files…
zh_hans: 正在同步 %d 个文件…
zh_hant_hk: 正在同步 %d 個檔案⋯

# icloud.status.uploading
source: Uploading %d files…
zh_hans: 正在上传 %d 个文件…
zh_hant_hk: 正在上傳 %d 個檔案⋯

# icloud.summary.off
source: Off
zh_hans: 未开启
zh_hant_hk: 未開啟

# icloud.summary.on
source: On
zh_hans: 已开启
zh_hant_hk: 已開啟

# icloud.sync_fonts_toggle
source: Sync Fonts
zh_hans: 同步字体
zh_hant_hk: 同步字型

# icloud.sync_footer.off
source: Project files stay on this device. Turn this on to move local projects into iCloud and show iCloud projects.
zh_hans: 项目文件会保留在本设备。开启后会把本地项目迁移到 iCloud，并显示 iCloud 中的项目。
zh_hant_hk: 專案檔案會保留在本裝置。開啟後會將本機專案遷移到 iCloud，並顯示 iCloud 中的專案。
